app/Controllers/Admin.php

    public function index()
    {
        $db = \Config\Database::connect();
        $model = new ServiceModel();

        // --- A. HITUNG KAS BESAR (KEUANGAN) ---
        if ($db->tableExists('bookings')) {
            $builder = $db->table('bookings');

            $querySum = $builder->selectSum('total_revenue', 'omset')
                                ->selectSum('profit', 'laba') // INI KAS BESAR (Akumulasi Profit per Trip)
                                ->selectSum('pax', 'total_pax')
                                ->get()->getRow();

            $data['total_omset'] = $querySum->omset ?? 0;
            $data['total_laba']  = $querySum->laba ?? 0;
            $data['total_tamu']  = $querySum->total_pax ?? 0;

            // Ambil 5 Booking Terakhir
            $data['booking_list'] = $db->table('bookings')->orderBy('id', 'DESC')->limit(5)->get()->getResultArray();

            // Data Pie Chart
            $data['chart_confirmed'] = $db->table('bookings')->where('status', 'confirmed')->countAllResults();
            $data['chart_pending']   = $db->table('bookings')->where('status', 'pending')->countAllResults();
            $data['chart_completed'] = $db->table('bookings')->where('status', 'completed')->countAllResults();
            $data['chart_cancelled'] = $db->table('bookings')->where('status', 'cancelled')->countAllResults();
---
SELECT SUM(`total_revenue`) AS `omset`, SUM(`profit`) AS `laba`, SUM(`pax`) AS `total_pax`
FROM `bookings`
SELECT *
FROM `bookings`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'confirmed'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'cancelled'

        $wisataLautModel = new \App\Models\WisataLautModel();
        $konsumsiModel = new \App\Models\KonsumsiModel();
        $itineraryModel = new \App\Models\ItineraryModel();
        $data['wisata_darat'] = $wisataDaratModel->orderBy('id', 'DESC')->findAll();
        $data['wisata_laut'] = $wisataLautModel->orderBy('id', 'DESC')->findAll();
        $data['konsumsi'] = $konsumsiModel->orderBy('id', 'DESC')->findAll();
        $data['itinerary'] = $itineraryModel->orderBy('duration_day, day_number, time_start', 'ASC')->findAll();

        if ($db->tableExists('ref_cities')) {
            $data['list_kota'] = $db->table('ref_cities')->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `wisata_darat`
ORDER BY `id` DESC
SELECT *
FROM `wisata_laut`
ORDER BY `id` DESC
SELECT *
FROM `konsumsi`
ORDER BY `id` DESC
SELECT *
FROM `itinerary`
ORDER BY `duration_day` ASC, `day_number` ASC, `time_start` ASC
SELECT *
FROM `ref_cities`
ORDER BY `id` DESC

        // Konten Promo - Filter only promo content (exclude estimasi)
        if ($db->tableExists('site_content')) {
            // Group promo content by section_name (promo entries)
            $allContent = $db->table('site_content')
                ->where('page_name', 'promo')
                ->orderBy('section_name', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `site_content`
WHERE `page_name` = 'promo'
ORDER BY `section_name` DESC


        // Load Jadwal Kapal
        if ($db->tableExists('jadwal_kapal')) {
            $data['jadwals'] = $db->table('jadwal_kapal')->orderBy('jam_berangkat', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `jadwal_kapal`
ORDER BY `jam_berangkat` ASC

    public function update_slideshow()
    {
        $slideshowModel = new \App\Models\HeroSlideshowModel();
        $id = $this->request->getPost('id');
        $oldData = $slideshowModel->find($id);
---
SELECT *
FROM `hero_slideshow`
WHERE `hero_slideshow`.`id` = '7'

            'button_class' => $this->request->getPost('button_class') ?: 'btn-warning'
        ];

        if ($slideshowModel->update($id, $data)) {
---
UPDATE `hero_slideshow` SET `title` = '', `description` = '', `image_url` = 'uploads/hero/696a4acb1a9ad_Biru Oranye Abstrak Minimalis Persewaan Alat Kemah Twitter Header (3).png', `duration` = 4000, `button_label` = '', `button_url` = '/kalkulator', `button_class` = 'btn-warning', `updated_at` = '2026-01-17 01:09:13'
WHERE `hero_slideshow`.`id` IN ('7')

    public function delete_slideshow($id)
    {
        $slideshowModel = new \App\Models\HeroSlideshowModel();
        $slideshow = $slideshowModel->find($id);

        if (!$slideshow) {
            return $this->response->setJSON(['success' => false, 'message' => 'Slideshow not found']);
        }

        // Delete image file
        if (!empty($slideshow['image_url']) && file_exists($slideshow['image_url'])) {
            unlink($slideshow['image_url']);
        }

        if ($slideshowModel->delete($id)) {
---
SELECT *
FROM `hero_slideshow`
WHERE `hero_slideshow`.`id` = '6'
DELETE FROM `hero_slideshow`
WHERE `id` IN ('6')