app/Controllers/Kalkulator.php

    public function index()
    {
        $db = \Config\Database::connect();

        // 0. SET BAHASA - CEK GET PARAMETER UNTUK SWITCH BAHASA
        $lang = $this->request->getGet('lang') ?? session('language') ?? 'id';
        if(in_array($lang, ['id', 'en'])) {
            session()->set('language', $lang);
        } else {
            $lang = 'id';
            session()->set('language', $lang);
        }

        // Load language file using service
        helper('number');
        service('language')->setLocale($lang);

        // 1. AMBIL MENU DESTINASI
        $destinasi_menu = [];
        if ($db->tableExists('destinations')) {
            $destinasi_menu = $db->table('destinations')->where('is_active', 1)->get()->getResultArray();
        }
        if(empty($destinasi_menu)) {
            $destinasi_menu = [['name' => 'Karimunjawa', 'slug' => 'karimunjawa']];
        }

        // 2. DATA PETA & KOTA ASAL
        $kota_db = [];
        if ($db->tableExists('ref_cities')) {
            $kota_db = $db->table('ref_cities')->get()->getResultArray();
---
SELECT *
FROM `destinations`
WHERE `is_active` = 1
SELECT *
FROM `ref_cities`

             ];
        }

        $transport_darat = $db->table('service_categories')->where('type', 'transport_land')->get()->getResultArray();
---
SELECT *
FROM `service_categories`
WHERE `type` = 'transport_land'

        $getRichData = function($types) use ($db) {
            if(!is_array($types)) $types = [$types];

            $items = $db->table('service_categories')
                        ->select('id, name, type, description, price_publish, price_net, image_url')
                        ->whereIn('type', $types)
                        ->orderBy('price_publish', 'ASC')
                        ->get()->getResultArray();
---
SELECT `id`, `name`, `type`, `description`, `price_publish`, `price_net`, `image_url`
FROM `service_categories`
WHERE `type` IN ('stay','homestay')
ORDER BY `price_publish` ASC

            foreach($items as &$item) {
                // Jika tidak ada gambar di service_categories, coba ambil dari service_gallery
                if(empty($item['image_url'])) {
                    $gallery = $db->table('service_gallery')
                                  ->where('service_id', $item['id'])
                                  ->select('image_url')
                                  ->get()->getRowArray();
---
SELECT `image_url`
FROM `service_gallery`
WHERE `service_id` = '33'

                }

                if($db->tableExists('service_gallery')){
                    $item['gallery'] = $db->table('service_gallery')->where('service_id', $item['id'])->get()->getResultArray();
---
SELECT *
FROM `service_gallery`
WHERE `service_id` = '33'

        $wisataLautModel = new \App\Models\WisataLautModel();
        $itineraryModel = new \App\Models\ItineraryModel();

        $tour_darat = $wisataDaratModel->where('is_active', 1)->findAll();
        $tour_laut = $wisataLautModel->where('is_active', 1)->findAll();
---
SELECT *
FROM `wisata_darat`
WHERE `is_active` = 1
SELECT *
FROM `wisata_laut`
WHERE `is_active` = 1

        $lokal     = $getRichData(['transport_local']);
        $guide     = $getRichData(['guide']);

        $kapal     = $db->table('service_categories')->where('type', 'transport_sea')->get()->getResultArray();
---
SELECT *
FROM `service_categories`
WHERE `type` = 'transport_sea'

        $promos = [];
        if ($db->tableExists('site_content')) {
            // Get all non-estimasi content, then group by ID
            $allContent = $db->table('site_content')
                ->where('page_name !=', 'estimasi')
                ->orderBy('id', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `site_content`
WHERE `page_name` != 'estimasi'
ORDER BY `id` DESC

        // 7. AMBIL INFO DESCRIPTIONS (UNTUK TOOLTIP/POPOVER)
        $service_info = [];
        if ($db->tableExists('service_info')) {
            $info_list = $db->table('service_info')->get()->getResultArray();
---
SELECT *
FROM `service_info`

        // 7b. AMBIL ESTIMASI SETTINGS (untuk info popover)
        $estimasi_settings = [];
        if ($db->tableExists('site_content')) {
            $estimasi_list = $db->table('site_content')
                ->where('page_name', 'estimasi')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `site_content`
WHERE `page_name` = 'estimasi'