app/Controllers/Settings.php

SELECT *
FROM `site_settings`
---
    public function settingsUnified()
    {
        // Ambil semua settings dari site_settings table
        $settingsData = $this->db->table('site_settings')
            ->get()
            ->getResultArray();