app/Models/HeroSlideshowModel.php

SELECT *
FROM `hero_slideshow`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
    public function getActiveSlideshows()
    {
        return $this->where('is_active', 1)
                    ->orderBy('sort_order', 'ASC')
                    ->findAll();

SELECT *
FROM `hero_slideshow`
ORDER BY `sort_order` ASC
---
    public function getAllSlideshows()
    {
        return $this->orderBy('sort_order', 'ASC')->findAll();

SELECT *
FROM `hero_slideshow`
WHERE `hero_slideshow`.`id` = '7'
UPDATE `hero_slideshow` SET `is_active` = 0, `updated_at` = '2026-01-16 19:37:33'
WHERE `hero_slideshow`.`id` IN ('7')
---
    public function toggleActive($id)
    {
        $current = $this->find($id);
        if ($current) {
            return $this->update($id, ['is_active' => !$current['is_active']]);