app/Models/ItineraryModel.php

SELECT *
FROM `itinerary`
WHERE `duration_day` = 2
AND `is_active` = 1
ORDER BY `day_number` ASC, `time_start` ASC
---
    public function getByDuration($duration)
    {
        return $this->where('duration_day', $duration)
                    ->where('is_active', 1)
                    ->orderBy('day_number, time_start', 'ASC')
                    ->findAll();