app/Views/admin_settings_unified.php

                                <?php
                                    $db = \Config\Database::connect();
                                    if ($db->tableExists('jadwal_kapal')) {
                                        $jadwals = $db->table('jadwal_kapal')->orderBy('jam_berangkat', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `jadwal_kapal`
ORDER BY `jam_berangkat` ASC