app/Views/admin_dashboard.php

SELECT *
FROM `jadwal_kapal`
ORDER BY `id` DESC
---
                                        <?php
                                            $db = \Config\Database::connect();
                                            if ($db->tableExists('jadwal_kapal')) {
                                                $jadwals = $db->table('jadwal_kapal')->orderBy('id', 'DESC')->get()->getResultArray();